esphome/esphome/esphome/components/esp32_ble_tracker/esp32_ble_tracker.cpp
    https://github.com/espressif/esp-idf/issues/6688

  */

  // Start scan: reached when scanner_state_ becomes IDLE (via set_scanner_state_()) and
  // no clients are in the transient CONNECTING / DISCOVERED / DISCONNECTING states
  // (their state changes increment version when they finish). CONNECTED / ESTABLISHED
  // clients do NOT block this branch — the coex revert below has its own active-count gate.
  if (this->scanner_state_ == ScannerState::IDLE && !counts.connecting && !counts.disconnecting && !counts.discovered) {
#ifdef USE_ESP32_BLE_SOFTWARE_COEXISTENCE
    // Only revert to BALANCE when no connections are active. Established connections
    // continue to need PREFER_BT so peer GATT responses can reach us while WiFi traffic
    // (advertisement upload, log streaming) competes for the shared radio. Reverting too
    // early causes Bluedroid to time out at ~20s and synthesize status=133.
    if (!counts.active) {
      this->update_coex_preference_(false);
    }
#endif
    if (this->scan_continuous_) {
      this->start_scan_(false);  // first = false
    }
  }
  // Promote discovered clients: reached when a client's state becomes DISCOVERED (via set_state()),
  // or when a blocking condition clears (connecting client finishes, scanner reaches RUNNING/IDLE).
  // All these trigger state_version_ increment, so we'll process and check promotion eligibility.
  // We check both RUNNING and IDLE states because:
  // - RUNNING: gap_scan_event_handler initiates stop_scan_() but promotion can happen immediately
  // - IDLE: Scanner has already stopped (naturally or by gap_scan_event_handler)
  if (counts.discovered && !counts.connecting &&
      (this->scanner_state_ == ScannerState::RUNNING || this->scanner_state_ == ScannerState::IDLE)) {
    this->try_promote_discovered_clients_();
  }
}

void ESP32BLETracker::start_scan() { this->start_scan_(true); }

void ESP32BLETracker::stop_scan() {
  // V to match the start log: the mode-switch and OTA callers narrate their
  // reason at D themselves, and the user-facing stop action is deliberate.
  ESP_LOGV(TAG, "Stopping scan.");
  this->scan_continuous_ = false;
#ifdef ESPHOME_ESP32_BLE_TRACKER_CLIENT_COUNT
  // The window-change restart is abandoned with continuous scanning.
  this->skip_next_scan_end_ = false;
#endif
  this->stop_scan_();
}

void ESP32BLETracker::ble_before_disabled_event_handler() {
  // Tell the controller to stop; a scan still starting has nothing to stop yet.
  if (this->scanner_state_ == ScannerState::RUNNING || this->scanner_state_ == ScannerState::FAILED) {
    this->stop_scan_();
  }
#ifdef ESPHOME_ESP32_BLE_TRACKER_CLIENT_COUNT
  for (auto *client : this->clients_) {
    client->ble_before_disabled_event_handler();
  }
  this->skip_next_scan_end_ = false;
#endif
  // The stop above never completes (stack torn down, events dropped); settle
  // here so start_scan_() sees IDLE once the stack is back.
  if (this->scanner_state_ != ScannerState::IDLE) {
    this->cleanup_scan_state_(true);
  }
  // A failure latched by the old stack must not be handled against the next.
  this->scan_start_failed_ = ESP_BT_STATUS_SUCCESS;
  this->scan_set_param_failed_ = ESP_BT_STATUS_SUCCESS;
  this->ble_was_disabled_ = true;
}

bool ESP32BLETracker::stop_scan_() {
  if (this->scanner_state_ != ScannerState::RUNNING && this->scanner_state_ != ScannerState::FAILED) {
    // IDLE means there is nothing to stop; STOPPING means a stop is already in
    // flight and will finish on its own. Neither is an error.
    if (this->scanner_state_ != ScannerState::IDLE && this->scanner_state_ != ScannerState::STOPPING) {
      ESP_LOGE(TAG, "Cannot stop scan: %s", this->scanner_state_to_string_(this->scanner_state_));
    }
    return false;
  }
  // Reset timeout state machine when stopping scan
  this->scan_timeout_state_ = ScanTimeoutState::INACTIVE;
  this->set_scanner_state_(ScannerState::STOPPING);
  esp_err_t err = esp_ble_gap_stop_scanning();
  if (err != ESP_OK) {
    ESP_LOGE(TAG, "esp_ble_gap_stop_scanning failed: %d", err);
    return false;
  }
  return true;
}

void ESP32BLETracker::start_scan_(bool first) {
  if (!this->parent_->is_active()) {
    ESP_LOGW(TAG, "Cannot start scan while ESP32BLE is disabled.");
    return;
  }
  if (this->scanner_state_ != ScannerState::IDLE) {
    this->log_unexpected_state_("start scan", ScannerState::IDLE);
    return;
  }
  this->set_scanner_state_(ScannerState::STARTING);
  ESP_LOGV(TAG, "Starting scan, set scanner state to STARTING.");
  if (!first)
    this->notify_scan_end_();
#ifdef ESPHOME_ESP32_BLE_TRACKER_CLIENT_COUNT
  this->skip_next_scan_end_ = false;
#endif
#ifdef USE_ESP32_BLE_DEVICE
  this->discovered_log_.clear();
#endif
  this->scan_params_.scan_type = this->scan_active_ ? BLE_SCAN_TYPE_ACTIVE : BLE_SCAN_TYPE_PASSIVE;
  this->scan_params_.own_addr_type = BLE_ADDR_TYPE_PUBLIC;
  this->scan_params_.scan_filter_policy = BLE_SCAN_FILTER_ALLOW_ALL;
  this->scan_params_.scan_interval = this->scan_interval_;
#ifdef ESPHOME_ESP32_BLE_TRACKER_CLIENT_COUNT
  // Count fresh: an automation can start a scan before loop() refreshes the counts.
  const uint32_t window = this->desired_scan_window_(this->count_client_states_().active);
  if (window != this->scan_window_) {
    // Guarantee the connection airtime instead of scanning wall to wall.
    ESP_LOGV(TAG, "Connection active, using %" PRIu32 " unit scan window", window);
  }
#else
  const uint32_t window = this->scan_window_;
#endif
  this->scan_params_.scan_window = window;

  // Start timeout monitoring in loop() instead of using scheduler
  // This prevents false reboots when the loop is blocked
  this->scan_start_time_ = App.get_loop_component_start_time();
  this->scan_timeout_ms_ = this->scan_duration_ * 2000;
  this->scan_timeout_state_ = ScanTimeoutState::MONITORING;

  esp_err_t err = esp_ble_gap_set_scan_params(&this->scan_params_);
  if (err != ESP_OK) {
    ESP_LOGE(TAG, "esp_ble_gap_set_scan_params failed: %d", err);
    return;
  }
  err = esp_ble_gap_start_scanning(this->scan_duration_);
  if (err != ESP_OK) {
    ESP_LOGE(TAG, "esp_ble_gap_start_scanning failed: %d", err);
    return;
  }
}

void ESP32BLETracker::register_client(ESPBTClient *client) {
#ifdef ESPHOME_ESP32_BLE_TRACKER_CLIENT_COUNT
  client->app_id = ++this->app_id_;
  // Give client a pointer to our state_version_ so it can notify us of state changes.
  // This enables loop() fast-path optimization - we skip expensive work when no state changed.
  // Safe because ESP32BLETracker (singleton) outlives all registered clients.
  client->set_tracker_state_version(&this->state_version_);
  this->clients_.push_back(client);
  // Registration is add-only, so the flag is a monotonic OR.
  if (client->wants_parsed_advertisements())
    this->parse_advertisements_ = true;
#endif
}

void ESP32BLETracker::register_listener(ble_device_base::ESPBTDeviceListener *listener) {
#ifdef ESPHOME_BLE_DEVICE_BASE_LISTENER_COUNT
  // Neutral BLEHub path (migrated sensors): parsed-advertisement consumers only.
  this->neutral_listeners_.push_back(listener);
  this->parse_advertisements_ = true;
#endif
}

void ESP32BLETracker::register_listener(ESPBTDeviceListener *listener) {
#ifdef ESPHOME_ESP32_BLE_TRACKER_LISTENER_COUNT
  listener->set_parent(this);
  this->listeners_.push_back(listener);
  this->parse_advertisements_ = true;
#endif
}

